# ReleaseConditions Constructor (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ReleaseConditions Constructor
ReleaseConditions Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ReleaseConditions(Boolean) | Creates a new instance of ReleaseConditions. |
| ReleaseConditions(Boolean, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean) | Creates a new instance of ReleaseConditions. |

# See Also
ReleaseConditions Class
ReleaseConditions Members
Autodesk.Revit.DB.Structure Namespace